list_star = [
    [1,20,'水瓶座'],
    [2,19,'双鱼座'],
    [3,21,'白羊座'],
    [4,20,'金牛座'],
    [5,21,'双子座'],
    [6,22,'巨蟹座'],
    [7,23,'狮子座'],
    [8,23,'处女座'],
    [9,23,'天秤座'],
    [10,24,'天蝎座'],
    [11,23,'射手座'],
    [12,22,'摩羯座']
             ]
def start_ps(a,b):
    a = int(input('请输入月份（例如5月）：'))
    b = int(input('请输入日期（例如22）：'))
    if a not in range(1,13):
        print('一年只有12个月哦～')
        exit
    for i in list_star:
        if a == i[0]:
            if b >= i[1]:
                print('{}月{}日星座为：{}'.format(a,b,i[2]))
        else:
            print('{}月{}日星座为：{}'.format(a,b,list_star[a-2][2]))